package org.com.deputatbot.domain;

public enum Partia {
         BPP("Партія Блок Петра Порошенка Солідарність"),                        OB("Політична Партія Опозиційний блок"),
            YKROP("ПОЛІТИЧНА ПАРТІЯ УКРАЇНСЬКЕ ОБ’ЄДНАННЯ ПАТРІОТІВ – УКРОП"),   BUT("Політична партія Всеукраїнське об’єднання Батьківщина"),
            VDR("Партія Відродження"),                                           GC("Партія Громадська сила"),
            RPL("Політична партія Радикальна партія Олега Ляшка"),               GP("Політична партія Громадянська позиція"),
            PZY("Партія Зелених України"),                                       NK("ПОЛІТИЧНА ПАРТІЯ ГРОМАДСЬКИЙ РУХ НАРОДНИЙ КОНТРОЛЬ"),
            SMPH("Політична партія Об’єднання САМОПОМІЧ"),                       PZV("Партія захисників Вітчизни"),
            PMC("Політична партія Партія місцевого самоврядування"),             CL("Політична партія Сила людей"),
            CVBD("Політична партія Всеукраїнське об’єднання Свобода"),           NAK("Політична партія Наш край"),
            O("Політична партія Основа"),                                        AP("Політична партія Аграрна партія"),
            ZG("Політична партія За життя"),                                     C("Політична партія СЛУГА НАРОДУ"),
            ES("Політична партія Європейська солідарність"),                     NF("Політична партія Народний фронт"),
            CY("Партія Сергія Тігіпка Сильна Україна"),                          ZACT("ПОЛІТИЧНА ПАРТІЯ ВСЕУКРАЇНСЬКЕ АГРАРНЕ ОБ’ЄДНАННЯ ЗАСТУП"),
            KPY("Комуністична партія України"),                                  CLAV("Політична партія Республіканська партія Славутич"),
            VOL("Політична партія Воля"),                                        DEA("Політична партія Демократичний альянс"),
            CPR("Партія Справедливість"),                                        NDPY("Політична партія Національна Демократична партія України"),
            PC("Політична партія ПРАВИЙ СЕКТОР"),                                NPY("Політична партія Народний Рух України"),
            ZEL("Політична партія Зелені"),                                      SZY("Партія Солідарність жінок України"),
            YS("ПОЛІТИЧНА ПАРТІЯ УКРАЇНА СЛАВЕТНА"),                             ZP("Українська партія Зелена планета"),
            NP("Політична партія НОВА ПОЛІТИКА"),                                BLCY("ПОЛІТИЧНА ПАРТІЯ БЛОК ЛІВИХ СИЛ УКРАЇНИ"),
            OPZG("Політична партія ОПОЗИЦІЙНА ПЛАТФОРМА – ЗА ЖИТТЯ"),            YP("ПОЛІТИЧНА ПАРТІЯ УКРАЇНСЬКА ПЕРСПЕКТИВА"),
            COBOR("Політична партія Українська платформа СОБОР"),                LPY("Ліберальна партія України");
    private String name;

    Partia(String name)
    {
         this.name=name;
    }

    public String GetPartiaName()
    {return name;}

}
